zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
    if (divider == 0U) /*!<  halt */
    {
        *pClkDiv |= 1UL << 30U;
    }
    else
    {
        *pClkDiv = divider - 1U;

        while (((*pClkDiv) & 0x80000000U) != 0U)
        {
        }
    }
}

uint32_t CLOCK_GetFreq(clock_name_t clockName)
{
    uint32_t freq = 0U;

    switch (clockName)
    {
        case kCLOCK_CoreSysClk:
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
        case kCLOCK_BusClk:
            freq = CLOCK_GetComputeMainClkFreq();
            break;
        case kCLOCK_Vdd2ClockOutClk:
            freq = CLOCK_GetClockOutClkFreq();
            break;
        case kCLOCK_Wdt0Clk:
            freq = CLOCK_GetWdtClkFreq(0U);
            break;
        case kCLOCK_Wdt1Clk:
            freq = CLOCK_GetWdtClkFreq(1U);
            break;
        case kCLOCK_Xspi0Clk:
            freq = CLOCK_GetXspiClkFreq(0U);
            break;
        case kCLOCK_Xspi1Clk:
            freq = CLOCK_GetXspiClkFreq(1U);
            break;
        case kCLOCK_SctClk:
            freq = CLOCK_GetSctClkFreq();
            break;
        case kCLOCK_Hifi4CpuClk:
            freq = CLOCK_GetHifi4ClkFreq();
            break;
        case kCLOCK_LPFlexComm0Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(0U);
            break;
        case kCLOCK_LPFlexComm1Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(1U);
            break;
        case kCLOCK_LPFlexComm2Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(2U);
            break;
        case kCLOCK_LPFlexComm3Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(3U);
            break;
        case kCLOCK_LPFlexComm4Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(4U);
            break;
        case kCLOCK_LPFlexComm5Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(5U);
            break;
        case kCLOCK_LPFlexComm6Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(6U);
            break;
        case kCLOCK_LPFlexComm7Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(7U);
            break;
        case kCLOCK_LPFlexComm8Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(8U);
            break;
        case kCLOCK_LPFlexComm9Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(9U);
            break;
        case kCLOCK_LPFlexComm10Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(10U);
            break;
        case kCLOCK_LPFlexComm11Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(11U);
            break;
        case kCLOCK_LPFlexComm12Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(12U);
            break;
        case kCLOCK_LPFlexComm13Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(13U);
            break;
#else
        case kCLOCK_BusClk:
            freq = CLOCK_GetSenseMainClkFreq();
            break;
        case kCLOCK_Wdt2Clk:
            freq = CLOCK_GetWdtClkFreq(2U);
            break;
        case kCLOCK_Wdt3Clk:
            freq = CLOCK_GetWdtClkFreq(3U);
            break;
        case kCLOCK_Hifi1CpuClk:
            freq = CLOCK_GetHifi1ClkFreq();
            break;
        case kCLOCK_LPFlexComm17Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(17U);
            break;
        case kCLOCK_LPFlexComm18Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(18U);
            break;
        case kCLOCK_LPFlexComm19Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(19U);
            break;
        case kCLOCK_LPFlexComm20Clk:
            freq = CLOCK_GetLPFlexCommClkFreq(20U);
            break;
#endif

        case kCLOCK_MclkClk:
            freq = CLOCK_GetMclkInClkFreq();
            break;
        case kCLOCK_Vdd1ClockOutClk:
            freq = CLOCK_GetVdd1ClockOutClkFreq();
            break;
        case kCLOCK_AdcClk:
            freq = CLOCK_GetAdcClkFreq();
            break;
        case kCLOCK_Xspi2Clk:
            freq = CLOCK_GetXspiClkFreq(2U);
            break;
        case kCLOCK_SystickClk:
            freq = CLOCK_GetSystickClkFreq();
            break;
        case kCLOCK_Sdio0Clk:
            freq = CLOCK_GetUsdhcClkFreq(0U);
            break;
        case kCLOCK_Sdio1Clk:
            freq = CLOCK_GetUsdhcClkFreq(1U);
            break;
        case kCLOCK_I3cClk:
            freq = CLOCK_GetI3cClkFreq();
            break;
        case kCLOCK_Usb0Clk:
            freq = CLOCK_GetMediaVddnClkFreq();
            break;
        case kCLOCK_Usb1Clk:
            freq = CLOCK_GetUsbClkFreq();
            break;
        case kCLOCK_PdmClk:
            freq = CLOCK_GetMicfilClkFreq();
            break;
        case kCLOCK_AcmpClk:
            freq = CLOCK_GetAcmpClkFreq();
            break;
        case kCLOCK_LPSpi14Clk:
            freq = CLOCK_GetLPSpiClkFreq(14U);
            break;
        case kCLOCK_LPSpi16Clk:
            freq = CLOCK_GetLPSpiClkFreq(16U);
            break;
        case kCLOCK_LPI2c15Clk:
            freq = CLOCK_GetLPI2cClkFreq(15U);
            break;
        case kCLOCK_FlexioClk:
            freq = CLOCK_GetFlexioClkFreq();
            break;
        case kCLOCK_VgpuClk:
            freq = CLOCK_GetVgpuClkFreq();
            break;
        case kCLOCK_LcdifClk:
            freq = CLOCK_GetLcdifClkFreq();
            break;
        case kCLOCK_MipiDphyClk:
            freq = CLOCK_GetMipiDphyClkFreq();
            break;
        case kCLOCK_MipiDphyEscRxClk:
            freq = CLOCK_GetMipiDphyEscRxClkFreq();
            break;
        case kCLOCK_MipiDphyEscTxClk:
            freq = CLOCK_GetMipiDphyEscTxClkFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
/*!
 * brief Get the FRO instance from peripheral base address.
 *
 * param base FRO peripheral base address.
 * return FRO instance.
 */
static uint32_t CLOCK_FroGetInstance(FRO_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0U; instance < ARRAY_SIZE(s_froBases); instance++)
    {
        if (s_froBases[instance] == base)
        {
            break;
        }
    }

