zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
static uint32_t CLOCK_CalFroFreqFromTrimcnt(FRO_Type *base)
{
    uint32_t freq    = 0U;
    uint32_t refFreq = 0U;

    refFreq = (g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq;
    freq    = ((uint32_t)((uint64_t)(base->TRIMCNT.RW & FRO_TRIMCNT_TRIMCNT_MASK) *
                       ((uint64_t)refFreq / (uint64_t)((base->CNFG1.RW & FRO_CNFG1_REFDIV_MASK) + 1UL)) /
                       (uint64_t)((base->CNFG1.RW & FRO_CNFG1_RFCLKCNT_MASK) >> FRO_CNFG1_RFCLKCNT_SHIFT)));

    return freq;
}

/*!
 * @brief Check if current frequency is in the set range of target frequency.
 * @param curFreq current frequency
 * @param targetFreq target frequency
 * @param range The percentage value, The value/100 is the % deviation.
 */
static bool CLOCK_CheckFreqWithinRange(uint32_t curFreq, uint32_t targetFreq, uint32_t range)
{
    uint64_t temp = 0U;
    if (curFreq >= targetFreq)
    {
        temp = ((uint64_t)curFreq - targetFreq) * 10000ULL / targetFreq;
    }
    else
    {
        temp = ((uint64_t)targetFreq - curFreq) * 10000ULL / targetFreq;
    }

    return ((uint32_t)temp > range ? false : true);
}

/*
 * Calculate the approximate delay(count per reference clock) for FRO auto tuner lock.
 */
static uint32_t CLOCK_CalFroAutoTuneTimeout(FRO_Type *base)
{
    uint32_t count;
    uint32_t refCnt     = (base->CNFG1.RW & FRO_CNFG1_RFCLKCNT_MASK) >> FRO_CNFG1_RFCLKCNT_SHIFT;
    uint32_t trim1Delay = (base->CNFG2.RW & FRO_CNFG2_TRIM1_DELAY_MASK) >> FRO_CNFG2_TRIM1_DELAY_SHIFT;
    uint32_t trim2Delay = (base->CNFG2.RW & FRO_CNFG2_TRIM2_DELAY_MASK) >> FRO_CNFG2_TRIM2_DELAY_SHIFT;

    /* Coarse tuning involves delay 4096 / 16 (COARSE=0) or 4096 / 128 (COARSEN=1). */
    count = (((base->CSR.RW & FRO_CSR_COARSEN_MASK) != 0U) ? 32U : 256U) * (refCnt + trim2Delay + 1U);
    count += (refCnt + trim1Delay + 1U) * 22U;

    return count;
}

uint32_t CLOCK_FroTuneOnce(FRO_Type *base, uint16_t trimVal)
{
    uint32_t targetFreq = 0U;
    uint32_t refFreq;
    uint32_t delayUs;

    refFreq = (g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq;

    if (refFreq != 0U)
    {
        /* Disable auto-tuner to use FROTRIM to control FRO frequency. */
        base->CSR.CLR = FRO_CSR_TREN_MASK | FRO_CSR_TRUPEN_MASK;

        /* 1. Program the desired trim in FROTRIM */
        base->FROTRIM.RW =
            (base->FROTRIM.RW & (~(FRO_FROTRIM_COARSE_TRIM_MASK | FRO_FROTRIM_FINE_TRIM_MASK))) | trimVal;
        base->CSR.CLR = FRO_CSR_TUNEONCE_DONE_MASK;
        /* 2. Make sure you wait enough time for the frequency to settle after applying the trim. */
        refFreq /= ((base->CNFG1.RW & FRO_CNFG1_REFDIV_MASK) >> FRO_CNFG1_REFDIV_SHIFT) + 1U;
        delayUs = (base->CNFG2.RW & FRO_CNFG2_TRIM2_DELAY_MASK) >> FRO_CNFG2_TRIM2_DELAY_SHIFT;
        delayUs = delayUs * 1000000UL / refFreq;
        SDK_DelayAtLeastUs(delayUs, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        /* 3. Enable TUNEONCE, TREN, but keep TRUPEN=0 -> this will allow the trims to be controlled by FROTRIM register
         * instead of the auto-tuner. */
        base->CSR.SET = FRO_CSR_TUNEONCE_MASK;
        base->CSR.SET = FRO_CSR_TREN_MASK;
        /* 4. Wait until TUNEONCE_DONE=1. */
        while (!(base->CSR.RW & FRO_CSR_TUNEONCE_DONE_MASK))
        {
        }
        /* 5. Read TRIMCNT to get the frequency measurement for the FROTRIM in step 1 */
        targetFreq    = CLOCK_CalFroFreqFromTrimcnt(base);
        base->CSR.CLR = FRO_CSR_TUNEONCE_MASK;
        base->CSR.CLR = FRO_CSR_TREN_MASK;
    }

    return targetFreq;
}

/*! Check the T+1, T, T-1 trim value and pick the closet one to targetFreq. */
void CLOCK_FroFineTune(FRO_Type *base, uint32_t targetFreq, uint16_t trimVal)
{
    uint32_t prevFreq, curFreq, nextFreq, prevDelta, curDelta, nextDelta;
    uint16_t fineTrim = 0U;

    assert(trimVal > 1U);

    prevFreq = CLOCK_FroTuneOnce(base, trimVal - 1U);
    curFreq  = CLOCK_FroTuneOnce(base, trimVal);
    nextFreq = CLOCK_FroTuneOnce(base, trimVal + 1U);

    prevDelta = (targetFreq < prevFreq) ? (prevFreq - targetFreq) : (targetFreq - prevFreq);
    curDelta  = (targetFreq < curFreq) ? (curFreq - targetFreq) : (targetFreq - curFreq);
    nextDelta = (targetFreq < nextFreq) ? (nextFreq - targetFreq) : (targetFreq - nextFreq);

    if (curDelta <= prevDelta && curDelta <= nextDelta)
    {
        fineTrim = trimVal;
    }
    else if (prevDelta < nextDelta)
    {
        fineTrim = trimVal - 1U;
    }
    else
    {
        fineTrim = trimVal + 1U;
    }

    CLOCK_ConfigFroTrim(base, fineTrim);
}

void CLOCK_EnableFroClkFreq(FRO_Type *base, uint32_t targetFreq, uint32_t divOutEnable)
{
    const clock_fro_config_t froAutotrimCfg = {
        .targetFreq   = targetFreq,
        .range        = 100U, /* For about 1.0% deviation. */
        .trim1DelayUs = 15U,
        .trim2DelayUs = 150U,
        .refDiv       = 1U,
        .enableInt    = 0U,
        .coarseTrimEn = true,
    };

    if (kStatus_Success == CLOCK_EnableFroClkFreqCloseLoop(base, &froAutotrimCfg, divOutEnable))
    {
        (void)CLOCK_EnableFroAutoTuning(base, &froAutotrimCfg, false);
    }
    else /* If the close loop not work, switch to open loop mode and search the nearest target frequency. */
    {
        CLOCK_FroFineTune(base, targetFreq, (uint16_t)(base->AUTOTRIM.RW & FRO_AUTOTRIM_AUTOTRIM_MASK));
        CLOCK_EnableFroClkOutput(base, divOutEnable);
    }
}

void CLOCK_ConfigFroTrim(FRO_Type *base, uint16_t trimVal)
{
    base->FROTRIM.RW = (base->FROTRIM.RW & ~(FRO_FROTRIM_COARSE_TRIM_MASK | FRO_FROTRIM_FINE_TRIM_MASK)) |
                       FRO_FROTRIM_COARSE_TRIM(((uint32_t)trimVal & 0xF80U) >> 0x7U) |
                       FRO_FROTRIM_FINE_TRIM((uint32_t)trimVal & 0x7FU);
}

status_t CLOCK_EnableFroClkFreqCloseLoop(FRO_Type *base, const clock_fro_config_t *config, uint32_t divOutEnable)
{
    status_t ret     = kStatus_Success;
    uint32_t freq    = 0U;
    uint32_t timeout = 0U;
    uint32_t refFreq = 0U;

    /*Power up FRO */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    SLEEPCON0->RUNCFG_CLR = (uint32_t)SLEEPCON0_RUNCFG_FRO0_PD_MASK << CLOCK_FroGetInstance(base);
#else
    SLEEPCON1->RUNCFG_CLR = (uint32_t)SLEEPCON1_RUNCFG_FRO2_PD_MASK;
#endif

    /* Disable output before changeing frequency. */
    CLOCK_EnableFroClkOutput(base, 0U);
    /* Clear TUNE_ERR LOL_ERR flags. */
    base->CSR.CLR = FRO_CSR_TUNE_ERR_MASK | FRO_CSR_LOL_ERR_MASK;
    ret           = CLOCK_EnableFroAutoTuning(base, config, true);

