zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
    timeout = CLOCK_CalFroAutoTuneTimeout(base);
    refFreq = (g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq;
    timeout = (SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY >> 2U) / refFreq * timeout;

    if (ret == kStatus_Success)
    {
        /* Polling wait tune finish. */
        while ((base->CSR.RW & FRO_CSR_TRIM_LOCK_MASK) == 0U)
        {
            if (timeout == 0U)
            {
                ret = kStatus_Timeout;
                break;
            }
            timeout--;
        }
        if (ret == kStatus_Success)
        {
            /* Check error. */
            if ((base->CSR.RW & (FRO_CSR_TUNE_ERR_MASK | FRO_CSR_LOL_ERR_MASK)) != 0U)
            {
                /* This is trim lock has happened and LOC comes back immediately. If measured freq matches the target
                freq. clear the LOL error like nothing has happened. */
                base->CSR.CLR = FRO_CSR_TUNE_ERR_MASK | FRO_CSR_LOL_ERR_MASK;

                freq = CLOCK_CalFroFreqFromTrimcnt(base);

                if (CLOCK_CheckFreqWithinRange(freq, config->targetFreq, config->range))
                {
                    /* Configure the FROTRIM with autotrim value. */
                    CLOCK_ConfigFroTrim(base, (uint16_t)(base->AUTOTRIM.RW & FRO_AUTOTRIM_AUTOTRIM_MASK));
                    /* Enable output */
                    CLOCK_EnableFroClkOutput(base, divOutEnable);
                    ret = kStatus_Success;
                }
                else
                {
                    /* Error occurs, suggest to use tuneonce feature to tune to desired frrequnency. */
                    ret = kStatus_Fail;
                }
            }
            else /* This is a normal case, no timeout, no errors. */
            {
                /* Configure the FROTRIM with autotrim value. */
                CLOCK_ConfigFroTrim(base, (uint16_t)(base->AUTOTRIM.RW & FRO_AUTOTRIM_AUTOTRIM_MASK));
                /* Enable output */
                CLOCK_EnableFroClkOutput(base, divOutEnable);
            }
        }
    }

    return ret;
}

void CLOCK_DisableFro(FRO_Type *base)
{
    CLOCK_EnableFroClkOutput(base, 0);
    base->CSR.CLR = FRO_CSR_FROEN_MASK | FRO_CSR_TREN_MASK | FRO_CSR_TRUPEN_MASK;

    /*Power down FRO */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    SLEEPCON0->RUNCFG_SET = (uint32_t)SLEEPCON0_RUNCFG_FRO0_PD_MASK << CLOCK_FroGetInstance(base);
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_FRO2_PD_MASK;
#endif
}

/* Initialize the SYSTEM PLL Clk */
/*! brief  Initialize the System PLL.
 *  param  config    : Configuration to set to PLL.
 */
void CLOCK_InitMainPll(const clock_main_pll_config_t *config)
{
    /* Power down MAINPLL before change fractional settings */
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_PLLLDO_PD_MASK | SLEEPCON0_RUNCFG_PLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_PLLLDO_PD_MASK | SLEEPCON1_RUNCFG_PLLANA_PD_MASK;
#endif

    CLKCTL2->MAINPLL0CLKSEL = (uint32_t)config->main_pll_src;
    CLKCTL2->MAINPLL0NUM    = config->numerator;
    CLKCTL2->MAINPLL0DENOM  = config->denominator;
    CLKCTL2->MAINPLL0CTL0   = (CLKCTL2->MAINPLL0CTL0 & ~CLKCTL2_MAINPLL0CTL0_MULT_MASK) |
                            CLKCTL2_MAINPLL0CTL0_MULT((uint32_t)(config->main_pll_mult));

    /* Clear System PLL reset*/
    CLKCTL2->MAINPLL0CTL0 &= ~CLKCTL2_MAINPLL0CTL0_RESET_MASK;
    /* Power up MAINPLL*/
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    SLEEPCON0->RUNCFG_CLR = SLEEPCON0_RUNCFG_PLLLDO_PD_MASK | SLEEPCON0_RUNCFG_PLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_CLR = SLEEPCON1_RUNCFG_PLLLDO_PD_MASK | SLEEPCON1_RUNCFG_PLLANA_PD_MASK;
#endif
    SDK_DelayAtLeastUs((CLKCTL2->MAINPLL0LOCKTIMEDIV2 & CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 2UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    /* Set System PLL HOLD_RING_OFF_ENA */
    CLKCTL2->MAINPLL0CTL0 |= CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK;
    SDK_DelayAtLeastUs((CLKCTL2->MAINPLL0LOCKTIMEDIV2 & CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 6UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    /* Clear System PLL HOLD_RING_OFF_ENA*/
    CLKCTL2->MAINPLL0CTL0 &= ~CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK;
    SDK_DelayAtLeastUs((CLKCTL2->MAINPLL0LOCKTIMEDIV2 & CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 3UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
}

/* Initialize the Main PLL PFD */
/*! brief Initialize the Main PLL PFD.
 *  param pfd    : Which PFD clock to enable.
 *  param divider    : The PFD divider value.
 *  note It is recommended that PFD settings are kept between 12-35.
 */
status_t CLOCK_InitMainPfd(clock_pfd_t pfd, uint8_t divider)
{
    uint32_t pfdIndex = (uint32_t)pfd;
    uint32_t syspfd;
    uint32_t timeout = PLL_PFD_LOCK_TIMEOUT;

    syspfd = CLKCTL2->MAINPLL0PFD &
             ~(((uint32_t)CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_MASK | (uint32_t)CLKCTL2_MAINPLL0PFD_PFD0_MASK)
               << (8UL * pfdIndex));

    /* Disable the clock output first. */
    CLKCTL2->MAINPLL0PFD = syspfd | ((uint32_t)CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_MASK << (8UL * pfdIndex));

    /* Set the new value and enable output. */
    CLKCTL2->MAINPLL0PFD = syspfd | (CLKCTL2_MAINPLL0PFD_PFD0(divider) << (8UL * pfdIndex));
    /* Wait for output becomes stable. */
    while ((CLKCTL2->MAINPLL0PFD & ((uint32_t)CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_MASK << (8UL * pfdIndex))) == 0UL)
    {
        timeout--;
        if (timeout == 0U)
        {
            return kStatus_Timeout;
        }
    }
    /* Clear ready status flag. */
    CLKCTL2->MAINPLL0PFD |= ((uint32_t)CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_MASK << (8UL * pfdIndex));

    return kStatus_Success;
}
/* Initialize the Audio PLL Clk */
/*! brief  Initialize the audio PLL.
 *  param  config    : Configuration to set to PLL.
 */
void CLOCK_InitAudioPll(const clock_audio_pll_config_t *config)
{
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    /* Power down Audio PLL before change fractional settings */
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON1_RUNCFG_AUDPLLANA_PD_MASK;
#endif

    CLKCTL2->AUDIOPLL0CLKSEL = (uint32_t)(config->audio_pll_src);
    CLKCTL2->AUDIOPLL0NUM    = config->numerator;
    CLKCTL2->AUDIOPLL0DENOM  = config->denominator;
    CLKCTL2->AUDIOPLL0CTL0   = (CLKCTL2->AUDIOPLL0CTL0 & ~CLKCTL2_AUDIOPLL0CTL0_MULT_MASK) |
                             CLKCTL2_AUDIOPLL0CTL0_MULT((uint32_t)(config->audio_pll_mult));

    /* Clear Audio PLL reset*/
    CLKCTL2->AUDIOPLL0CTL0 &= ~CLKCTL2_AUDIOPLL0CTL0_RESET_MASK;
    /* Power up Audio PLL*/
#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    /* Power down Audio PLL before change fractional settings */
    SLEEPCON0->RUNCFG_CLR = SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_CLR = SLEEPCON1_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON1_RUNCFG_AUDPLLANA_PD_MASK;
#endif
    SDK_DelayAtLeastUs((CLKCTL2->AUDIOPLL0LOCKTIMEDIV2 & CLKCTL2_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 2UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    /* Set Audio PLL HOLD_RING_OFF_ENA */
    CLKCTL2->AUDIOPLL0CTL0 |= CLKCTL2_AUDIOPLL0CTL0_HOLD_RING_OFF_ENA_MASK;
    SDK_DelayAtLeastUs((CLKCTL2->AUDIOPLL0LOCKTIMEDIV2 & CLKCTL2_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 6UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    /* Clear Audio PLL HOLD_RING_OFF_ENA*/
    CLKCTL2->AUDIOPLL0CTL0 &= ~CLKCTL2_AUDIOPLL0CTL0_HOLD_RING_OFF_ENA_MASK;
    SDK_DelayAtLeastUs((CLKCTL2->AUDIOPLL0LOCKTIMEDIV2 & CLKCTL2_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK) / 3UL,
                       SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    /* Each time after PLL power up, software needs to wait the whole PLL lock time the to enable VCO output .*/
    if (config->enableVcoOut)
    {
        CLKCTL2->AUDIOPLL0CTL0 |= CLKCTL2_AUDIOPLL0CTL0_VCO_OUT_ENABLE_MASK;
    }
    else
    {
        CLKCTL2->AUDIOPLL0CTL0 &= ~CLKCTL2_AUDIOPLL0CTL0_VCO_OUT_ENABLE_MASK;
    }
}

