zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
/* Initialize the Audio PLL PFD */
/*! brief Initialize the audio PLL PFD.
 *  param pfd    : Which PFD clock to enable.
 *  param divider    : The PFD divider value.
 *  note It is recommended that PFD settings are kept between 12-35.
 */
status_t CLOCK_InitAudioPfd(clock_pfd_t pfd, uint8_t divider)
{
    uint32_t pfdIndex = (uint32_t)pfd;
    uint32_t syspfd;
    uint32_t timeout = PLL_PFD_LOCK_TIMEOUT;

    syspfd = CLKCTL2->AUDIOPLL0PFD &
             ~(((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK | (uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_MASK)
               << (8UL * pfdIndex));

    /* Disable the clock output first. */
    CLKCTL2->AUDIOPLL0PFD = syspfd | ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8UL * pfdIndex));

    /* Set the new value and enable output. */
    CLKCTL2->AUDIOPLL0PFD = syspfd | (CLKCTL2_AUDIOPLL0PFD_PFD0(divider) << (8UL * pfdIndex));
    /* Wait for output becomes stable. */
    while ((CLKCTL2->AUDIOPLL0PFD & ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKRDY_MASK << (8UL * pfdIndex))) == 0UL)
    {
        timeout--;
        if (timeout == 0U)
        {
            return kStatus_Timeout;
        }
    }
    /* Clear ready status flag. */
    CLKCTL2->AUDIOPLL0PFD |= ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKRDY_MASK << (8UL * pfdIndex));

    return kStatus_Success;
}

/*! @brief  Enable/Disable sys osc clock from external crystal clock.
 *  @param  enable : true to enable system osc clock, false to bypass system osc.
 *  @param  enableLowPower : true to enable low power mode, false to enable high gain mode.
 *  @param  delay_us : Delay time after OSC power up.
 */
void CLOCK_EnableSysOscClk(bool enable, bool enableLowPower, uint32_t delay_us)
{
    uint32_t ctrl = enableLowPower ? CLKCTL2_SYSOSCCTL0_LP_ENABLE_MASK : 0U;

    if (enable)
    {
        CLKCTL2->SYSOSCCTL0   = ctrl;
        CLKCTL2->SYSOSCBYPASS = 0U;
        SDK_DelayAtLeastUs(delay_us, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }
    else
    {
        CLKCTL2->SYSOSCCTL0 = ctrl | CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE_MASK;
    }
}

void CLOCK_EnableOsc32K(clock_osc32k_config_t *config)
{
    uint32_t ctrl = OSC32KNP->CTRL;

    ctrl &= ~(OSC32KNP_CTRL_CAP_TRIM_MASK | OSC32KNP_CTRL_CLKMON_EN_MASK | OSC32KNP_CTRL_BYPASS_EN_MASK);
    OSC32KNP->CTRL = ctrl | OSC32KNP_CTRL_CAP_TRIM((uint32_t)config->cap) |
                     OSC32KNP_CTRL_CLKMON_EN((uint32_t)config->monitorEnable) |
                     OSC32KNP_CTRL_BYPASS_EN((uint32_t)config->bypass);

    if (config->lowPowerMode)
    {
        /* Disables the output of an oscillator on the channel before changing the OSC32KNP power mode of the channel.*/
        OSC32KNP->CTRL |= OSC32KNP_CTRL_OSC_DIS_MASK;
        /* Low power mode. */
        OSC32KNP->CTRL &= ~OSC32KNP_CTRL_MODE_MASK;
        /* Wait Self-Charge Oscillator stable. */
        while ((OSC32KNP->STAT & OSC32KNP_STAT_SCXO_STABLE_MASK) == 0U)
        {
        }
        OSC32KNP->CTRL &= ~OSC32KNP_CTRL_OSC_DIS_MASK;
    }
    else
    {
        if ((OSC32KNP->CTRL & OSC32KNP_CTRL_MODE_MASK) == 0U)
        {
            /* Can only change from high power mode to low power mode. */
            assert(false);
        }

        while ((OSC32KNP->STAT & OSC32KNP_STAT_TCXO_STABLE_MASK) == 0U)
        {
        }
    }
}

uint32_t CLOCK_GetOsc32KFreq(void)
{
    uint32_t freq = 0U;

    if ((OSC32KNP->CTRL & OSC32KNP_CTRL_OSC_DIS_MASK) == 0U)
    {
        freq = ((OSC32KNP->CTRL & OSC32KNP_CTRL_BYPASS_EN_MASK) != 0UL) ? g_32kClkinFreq : CLK_RTC_32K_CLK;
    }
    else /* OSC32KNP disabled. */
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetVddnComBaseClkFreq(void)
{
    uint32_t freq = 0U;

    switch (CLKCTL2->COMNBASECLKSEL & CLKCTL2_COMNBASECLKSEL_SEL_MASK)
    {
        case CLKCTL2_COMNBASECLKSEL_SEL(0U):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;
        case CLKCTL2_COMNBASECLKSEL_SEL(1U):
            freq = CLOCK_GetFroClkFreq(1U);
            break;
        case CLKCTL2_COMNBASECLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;
        case CLKCTL2_COMNBASECLKSEL_SEL(3U):
            freq = CLOCK_GetLpOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
/*! @brief  Enable/Disable FRO clock output. */
void CLOCK_EnableFro0ClkForDomain(uint32_t domainEnable)
{
    if (domainEnable != 0U)
    {
        /* Wait FRO stable first in case FRO just get powered on. */
        while ((CLKCTL0->FRO01CLKSTATUS & CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK) == 0U)
        {
        }
    }
    else
    {
        /* Do nothing */
    }
    CLKCTL0->FRO0MAXDOMAINEN = domainEnable & (uint32_t)kCLOCK_AllDomainEnable;
}

uint32_t CLOCK_GetComputeBaseClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;
    clkSel          = CLKCTL0->CMPTBASECLKSEL & CLKCTL0_CMPTBASECLKSEL_SEL_MASK;

    switch (clkSel)
    {
        case CLKCTL0_CMPTBASECLKSEL_SEL(0U):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(1U):
            freq = CLOCK_GetFroClkFreq(1U);
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(3U):
            freq = CLOCK_GetLpOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetComputeDspBaseClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;
    clkSel          = CLKCTL0->DSPBASECLKSEL & CLKCTL0_DSPBASECLKSEL_SEL_MASK;

    switch (clkSel)
    {
        case CLKCTL0_CMPTBASECLKSEL_SEL(0U):
            freq = CLOCK_GetFroClkFreq(1U) / 3U;
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(1U):
            freq = CLOCK_GetFroClkFreq(1U);
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(2U):
            freq = CLOCK_GetFroClkFreq(0U) / 3U;
            break;
        case CLKCTL0_CMPTBASECLKSEL_SEL(3U):
            freq = CLOCK_GetLpOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetVdd2ComBaseClkFreq(void)
{
    uint32_t freq = 0U;

