zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
            case kCLOCK_Pfd3:
                freq = (uint32_t)((uint64_t)freq * 18ULL /
                                  ((CLKCTL2->AUDIOPLL0PFD & CLKCTL2_AUDIOPLL0PFD_PFD3_MASK) >>
                                   CLKCTL2_AUDIOPLL0PFD_PFD3_SHIFT));
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq;
}

uint32_t CLOCK_GetWakeClk32KFreq(void)
{
    uint32_t freq = 0U;
    switch (CLKCTL3->WAKE32KCLKSEL & CLKCTL3_WAKE32KCLKSEL_SEL_MASK)
    {
        case CLKCTL3_WAKE32KCLKSEL_SEL(0):
            freq = CLOCK_GetOsc32KFreq();
            break;
        case CLKCTL3_WAKE32KCLKSEL_SEL(1):
            freq = CLOCK_GetLpOscFreq();
            freq /= 32U;
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetXspiClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
    if (id == 0U)
    {
        if ((CLKCTL0->XSPI0FCLKSEL & CLKCTL0_XSPI0FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL0->XSPI0FCLKSEL & CLKCTL0_XSPI0FCLKSEL_SEL_MASK)
            {
                case CLKCTL0_XSPI0FCLKSEL_SEL(0):
                    freq = CLOCK_GetVddnComBaseClkFreq();
                    break;
                case CLKCTL0_XSPI0FCLKSEL_SEL(1):
                    freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd0);
                    break;
                case CLKCTL0_XSPI0FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;
                case CLKCTL0_XSPI0FCLKSEL_SEL(3):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd1);
                    break;
                default:
                    /* Added comments to prevent the violation of MISRA C-2012 rule. */
                    break;
            }
            freq = freq / ((CLKCTL0->XSPI0FCLKDIV & CLKCTL0_XSPI0FCLKDIV_DIV_MASK) + 1U);
        }
        else
        {
            freq = 0U;
        }
    }
    else if (id == 1U)
    {
        if ((CLKCTL0->XSPI1FCLKSEL & CLKCTL0_XSPI1FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL0->XSPI1FCLKSEL & CLKCTL0_XSPI1FCLKSEL_SEL_MASK)
            {
                case CLKCTL0_XSPI1FCLKSEL_SEL(0):
                    freq = CLOCK_GetVddnComBaseClkFreq();
                    break;
                case CLKCTL0_XSPI1FCLKSEL_SEL(1):
                    freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd1);
                    break;
                case CLKCTL0_XSPI1FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;
                case CLKCTL0_XSPI1FCLKSEL_SEL(3):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd2);
                    break;
                default:
                    /* Added comments to prevent the violation of MISRA C-2012 rule. */
                    break;
            }
            freq = freq / ((CLKCTL0->XSPI1FCLKDIV & CLKCTL0_XSPI1FCLKDIV_DIV_MASK) + 1U);
        }
        else
        {
            freq = 0U;
        }
    }
    else if (id == 2U)
#else
    if (id == 2U)
#endif /* FSL_CLOCK_DRIVER_COMPUTE */
    {
        if ((CLKCTL4->XSPI2FCLKSEL & CLKCTL4_XSPI2FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL4->XSPI2FCLKSEL & CLKCTL4_XSPI2FCLKSEL_SEL_MASK)
            {
                case CLKCTL4_XSPI2FCLKSEL_SEL(0):
                    freq = CLOCK_GetVddnComBaseClkFreq();
                    break;
                case CLKCTL4_XSPI2FCLKSEL_SEL(1):
                    freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd1);
                    break;
                case CLKCTL4_XSPI2FCLKSEL_SEL(2):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;
                case CLKCTL4_XSPI2FCLKSEL_SEL(3):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd3);
                    break;
                default:
                    freq = 0U;
                    break;
            }
            freq = freq / ((CLKCTL4->XSPI2FCLKDIV & CLKCTL4_XSPI2FCLKDIV_DIV_MASK) + 1U);
        }
        else
        {
            freq = 0U;
        }
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

#if defined(FSL_CLOCK_DRIVER_COMPUTE) || defined(FSL_CLOCK_DRIVER_MEDIA)
uint32_t CLOCK_GetSctClkFreq(void)
{
    uint32_t freq = 0U;
    if ((CLKCTL0->SCTFCLKSEL & CLKCTL0_SCTFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch (CLKCTL0->SCTFCLKSEL & CLKCTL0_SCTFCLKSEL_SEL_MASK)
        {
            case CLKCTL0_SCTFCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;
            case CLKCTL0_SCTFCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;
            case CLKCTL0_SCTFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;
            case CLKCTL0_SCTFCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(0U) / 6U;
                break;
            default:
                freq = 0U;
                break;
        }
    }
    return freq / ((CLKCTL0->SCTFCLKDIV & CLKCTL0_SCTFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetUtickClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL0->UTICK0FCLKSEL & CLKCTL0_UTICK0FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch (CLKCTL0->UTICK0FCLKSEL & CLKCTL0_UTICK0FCLKSEL_SEL_MASK)
        {
            case CLKCTL0_UTICK0FCLKSEL_SEL(0):
                freq = CLOCK_GetComputeBaseClkFreq();
                break;
            case CLKCTL0_UTICK0FCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;
            case CLKCTL0_UTICK0FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;
            case CLKCTL0_UTICK0FCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U) / 2U;
                break;
            default:
                freq = 0U;
                break;
        }
    }
    return freq / ((CLKCTL0->UTICK0FCLKDIV & CLKCTL0_UTICK0FCLKDIV_DIV_MASK) + 1U);
}

