zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
uint32_t CLOCK_GetWdtClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if (id == 2U)
    {
        if ((CLKCTL1->WWDT2FCLKSEL & CLKCTL1_WWDT2FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL1->WWDT2FCLKSEL & CLKCTL1_WWDT2FCLKSEL_SEL_MASK)
            {
                case CLKCTL1_WWDT2FCLKSEL_SEL(0):
                    freq = CLOCK_GetLpOscFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
        }
    }
    else if (id == 3U)
    {
        if ((CLKCTL1->WWDT3FCLKSEL & CLKCTL1_WWDT3FCLKSEL_SEL_EN_MASK) != 0U)
        {
            switch (CLKCTL1->WWDT3FCLKSEL & CLKCTL1_WWDT3FCLKSEL_SEL_MASK)
            {
                case CLKCTL1_WWDT3FCLKSEL_SEL(0):
                    freq = CLOCK_GetLpOscFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
        }
    }

    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetSystickClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL1->SYSTICKFCLKSEL & CLKCTL1_SYSTICKFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch (CLKCTL1->SYSTICKFCLKSEL & CLKCTL1_SYSTICKFCLKSEL_SEL_MASK)
        {
            case CLKCTL1_SYSTICKFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;
            case CLKCTL1_SYSTICKFCLKSEL_SEL(1):
                freq = CLOCK_GetLpOscFreq();
                break;
            case CLKCTL1_SYSTICKFCLKSEL_SEL(2):
                freq = CLOCK_GetWakeClk32KFreq();
                break;
            case CLKCTL1_SYSTICKFCLKSEL_SEL(3):
                freq = CLOCK_GetXtalInClkFreq();
                break;
            default:
                freq = 0U;
                break;
        }
    }
    return freq / ((CLKCTL1->SYSTICKFCLKDIV & CLKCTL1_SYSTICKFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetCTimerClkFreq(uint32_t id)
{
    uint32_t freq = 0U;
    assert(id >= 5U);

    if ((CLKCTL1->CTIMERFCLKSEL[id - 5U] & CLKCTL1_CTIMERFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL1->CTIMERFCLKSEL[id - 5U]) & CLKCTL1_CTIMERFCLKSEL_SEL_MASK)
        {
            case CLKCTL1_CTIMERFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL1_CTIMERFCLKSEL_SEL(1):
                freq = CLOCK_GetSenseAudioClkFreq();
                break;

            case CLKCTL1_CTIMERFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(2U);
                break;

            case CLKCTL1_CTIMERFCLKSEL_SEL(3):
                freq = CLOCK_GetWakeClk32KFreq();
                break;

            default:
                freq = 0U;
                break;
        }
        freq = freq / ((CLKCTL1->CTIMERCLKDIV[id - 5U] & CLKCTL1_CTIMERCLKDIV_DIV_MASK) + 1U);
    }

    return freq;
}

uint32_t CLOCK_GetI3cClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL1->I3C23FCLKSEL & CLKCTL1_I3C23FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL1->I3C23FCLKSEL) & CLKCTL1_I3C23FCLKSEL_SEL_MASK)
        {
            case CLKCTL1_I3C23FCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL1_I3C23FCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(2U);
                break;

            case CLKCTL1_I3C23FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(1U) / 8U;
                break;

            case CLKCTL1_I3C23FCLKSEL_SEL(3):
                freq = CLOCK_GetXtalInClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL1->I3C23FCLKDIV & CLKCTL1_I3C23FCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetSaiClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL1->SAI3FCLKSEL & CLKCTL1_SAI3FCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL1->SAI3FCLKSEL) & CLKCTL1_SAI3FCLKSEL_SEL_MASK)
        {
            case CLKCTL1_SAI3FCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL1_SAI3FCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(2U) / 8U;
                break;

            case CLKCTL1_SAI3FCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(2U);
                break;

            case CLKCTL1_SAI3FCLKSEL_SEL(3):
                freq = CLOCK_GetSenseAudioClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL1->SAI3CLKDIV & CLKCTL1_SAI3CLKDIV_DIV_MASK) + 1U);
}

#endif /* FSL_CLOCK_DRIVER_COMPUTE */
uint32_t CLOCK_GetVdd1ClockOutClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL3->CLKOUTCLKSEL & CLKCTL3_CLKOUTCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL3->CLKOUTCLKSEL) & CLKCTL3_CLKOUTCLKSEL_SEL_MASK)
        {
            case CLKCTL3_CLKOUTCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL3_CLKOUTCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                break;

            case CLKCTL3_CLKOUTCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(0U);
                break;

            case CLKCTL3_CLKOUTCLKSEL_SEL(3):
                freq = CLOCK_GetFroClkFreq(1U);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL3->CLKOUTCLKDIV & CLKCTL3_CLKOUTCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetAdcClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL3->SARADCFCLKSEL & CLKCTL3_SARADCFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL3->SARADCFCLKSEL) & CLKCTL3_SARADCFCLKSEL_SEL_MASK)
        {
            case CLKCTL3_SARADCFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL3_SARADCFCLKSEL_SEL(1):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd1);
                break;

