zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_clock.c
            case CLKCTL3_SARADCFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(2U);
                break;

            case CLKCTL3_SARADCFCLKSEL_SEL(3):
                freq = CLOCK_GetXtalInClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL3->SARADCFCLKDIV & CLKCTL3_SARADCFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetAcmpClkFreq(void)
{
    return CLOCK_GetSenseMainClkFreq();
}

uint32_t CLOCK_GetUsbClkFreq(void)
{
    return CLOCK_GetMediaVddnClkFreq();
}

uint32_t CLOCK_GetSdAdcClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL3->SDADCFCLKSEL & CLKCTL3_SDADCFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL3->SDADCFCLKSEL) & CLKCTL3_SDADCFCLKSEL_SEL_MASK)
        {
            case CLKCTL3_SDADCFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL3_SDADCFCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(2) / 8U;
                break;

            case CLKCTL3_SDADCFCLKSEL_SEL(2):
                freq = CLOCK_GetAudioPllFreq();
                break;

            case CLKCTL3_SDADCFCLKSEL_SEL(3):
                freq = CLOCK_GetSenseAudioClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL3->SDADCFCLKDIV & CLKCTL3_SDADCFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetOSTimerClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL3->OSTIMERFCLKSEL & CLKCTL3_OSTIMERFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL3->OSTIMERFCLKSEL) & CLKCTL3_OSTIMERFCLKSEL_SEL_MASK)
        {
            case CLKCTL3_OSTIMERFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL3_OSTIMERFCLKSEL_SEL(1):
                freq = CLOCK_GetWakeClk32KFreq();
                break;

            case CLKCTL3_OSTIMERFCLKSEL_SEL(2):
                freq = CLOCK_GetLpOscFreq();
                break;

            case CLKCTL3_OSTIMERFCLKSEL_SEL(3):
                freq = CLOCK_GetXtalInClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL3->OSTIMERFCLKDIV & CLKCTL3_OSTIMERFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetMicfilClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL3->MICFILFCLKSEL & CLKCTL3_MICFILFCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL3->MICFILFCLKSEL) & CLKCTL3_MICFILFCLKSEL_SEL_MASK)
        {
            case CLKCTL3_MICFILFCLKSEL_SEL(0):
                freq = CLOCK_GetSenseBaseClkFreq();
                break;

            case CLKCTL3_MICFILFCLKSEL_SEL(1):
                freq = CLOCK_GetAudioPfdFreq(kCLOCK_Pfd3);
                break;

            case CLKCTL3_MICFILFCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(2);
                break;

            case CLKCTL3_MICFILFCLKSEL_SEL(3):
                freq = CLOCK_GetSenseAudioClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL3->MICFILFCLKDIV & CLKCTL3_MICFILFCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetFlexioClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLKCTL4->FLEXIOCLKSEL & CLKCTL4_FLEXIOCLKSEL_SEL_EN_MASK) != 0U)
    {
        switch ((CLKCTL4->FLEXIOCLKSEL) & CLKCTL4_FLEXIOCLKSEL_SEL_MASK)
        {
            case CLKCTL4_FLEXIOCLKSEL_SEL(0):
                freq = CLOCK_GetVdd2MediaBaseClkFreq();
                break;

            case CLKCTL4_FLEXIOCLKSEL_SEL(1):
                freq = CLOCK_GetFroClkFreq(0);
                break;

            case CLKCTL4_FLEXIOCLKSEL_SEL(2):
                freq = CLOCK_GetFroClkFreq(1);
                break;

            case CLKCTL4_FLEXIOCLKSEL_SEL(3):
                freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd3);
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq / ((CLKCTL4->FLEXIOCLKDIV & CLKCTL4_FLEXIOCLKDIV_DIV_MASK) + 1U);
}

uint32_t CLOCK_GetLPSpiClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    if (id == 14U)
    {
        if ((CLKCTL4->LPSPI14CLKSEL & CLKCTL4_LPSPI14CLKSEL_SEL_EN_MASK) != 0U)
        {
            switch ((CLKCTL4->LPSPI14CLKSEL) & CLKCTL4_LPSPI14CLKSEL_SEL_MASK)
            {
                case CLKCTL4_LPSPI14CLKSEL_SEL(0):
                    freq = CLOCK_GetVdd2MediaBaseClkFreq();
                    break;

                case CLKCTL4_LPSPI14CLKSEL_SEL(1):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;

                case CLKCTL4_LPSPI14CLKSEL_SEL(2):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                    break;

                case CLKCTL4_LPSPI14CLKSEL_SEL(3):
                    freq = CLOCK_GetFroClkFreq(1U);
                    break;

                default:
                    freq = 0U;
                    break;
            }
        }

        freq = freq / ((CLKCTL4->LPSPI14CLKDIV & CLKCTL4_LPSPI14CLKDIV_DIV_MASK) + 1U);
    }
    else if (id == 16U)
    {
        if ((CLKCTL4->LPSPI16CLKSEL & CLKCTL4_LPSPI16CLKSEL_SEL_EN_MASK) != 0U)
        {
            switch ((CLKCTL4->LPSPI16CLKSEL) & CLKCTL4_LPSPI16CLKSEL_SEL_MASK)
            {
                case CLKCTL4_LPSPI16CLKSEL_SEL(0):
                    freq = CLOCK_GetVdd2MediaBaseClkFreq();
                    break;

                case CLKCTL4_LPSPI16CLKSEL_SEL(1):
                    freq = CLOCK_GetFroClkFreq(0U);
                    break;

                case CLKCTL4_LPSPI16CLKSEL_SEL(2):
                    freq = CLOCK_GetMainPfdFreq(kCLOCK_Pfd0);
                    break;

                case CLKCTL4_LPSPI16CLKSEL_SEL(3):
                    freq = CLOCK_GetFroClkFreq(1U);
                    break;

                default:
                    freq = 0U;
                    break;
            }
        }

